dkhilalisaif/STM32F746_Drivers/drivers/Inc/stm32f746xx_spi_driver.h
/*
 * stm32f746xx_spi_driver.h
 *
 *  Created on: 8 Sept 2020
 *      Author: saif
 */

#ifndef INC_STM32F746XX_SPI_DRIVER_H_
#define INC_STM32F746XX_SPI_DRIVER_H_

#include "stm32f746xx.h"


typedef struct
{
	uint8_t SPI_DeviceMode;
	uint8_t SPI_BusConfig;
	uint8_t SPI_SclkSpeed;
	uint8_t SPI_DataSize;
	uint8_t SPI_CPOL;
	uint8_t SPI_CPHA;
	uint8_t SPI_SSM;


}SPI_Config_t;

/*
 * This is the Handle structure for an SPI Peripheral
 */

typedef struct
{
	//pointer to hold the base address of GPIO peripheral
	SPI_RegDef_t *pSPIx; /* < This holds the base address of the SPIx Peripheral  >*/
	SPI_Config_t SPI_Config; /*< This holds GPIO pin configuration settings >*/


}SPI_Handle_t;

/*
 *    @SPI_DeviceMode possible values
 */

#define SPI_DEVICE_MODE_SLAVE   0
#define SPI_DEVICE_MODE_MASTER  1

/*
 * @SPI_BusConfig possible values
 */

#define SPI_BUS_CONFIG_FD                   1
#define SPI_BUS_CONFIG_HD                   2
#define SPI_BUS_CONFIG_SIMPLEX_TXONLY       3
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY       4

/*
 * @SPI_SclkSpeed possible values
 */

#define SPI_SCLK_SPEED_DIV2      0
#define SPI_SCLK_SPEED_DIV4      1
#define SPI_SCLK_SPEED_DIV8      2
#define SPI_SCLK_SPEED_DIV16     3
#define SPI_SCLK_SPEED_DIV32     4
#define SPI_SCLK_SPEED_DIV64     5
#define SPI_SCLK_SPEED_DIV128    6
#define SPI_SCLK_SPEED_DIV256    7


/*
 * @SPI_DataSize Possible values
 */

#define SPI_DS_Not_Used_0             0
#define SPI_DS_Not_Used_1             1
#define SPI_DS_Not_Used_2             2
#define SPI_DS_4BITS                  3
#define SPI_DS_5BITS                  4
#define SPI_DS_6BITS                  5
#define SPI_DS_7BITS                  6
#define SPI_DS_8BITS                  7
#define SPI_DS_9BITS                  8
#define SPI_DS_10BITS                 9
#define SPI_DS_11BITS                 10
#define SPI_DS_12BITS                 11
#define SPI_DS_13BITS                 12
#define SPI_DS_14BITS                 13
#define SPI_DS_15BITS                 14
#define SPI_DS_16BITS                 15


/*
 * @SPI_CPOL possible values
 */

#define SPI_CPOL_HIGH              1
#define SPI_CPOL_LOW               0
/*
 * @SPI_CPHA possible values
 */

#define SPI_CPHA_HIGH              1
#define SPI_CPHA_LOW               0

/*
 * @SPI_SSM possible values
 */

#define SPI_SSM_DI                 0
#define SPI_SSM_EN                 1

/*
 * @FlagName possible values
 */
#define SPI_RXE_FLAG               (1 << SPI_SR_RXE)
#define SPI_TXE_FLAG               (1 << SPI_SR_TXE)
#define SPI_CHSIDE_FLAG            (1 << SPI_SR_CHSIDE)
#define SPI_UDR_FLAG               (1 << SPI_SR_UDR)
#define SPI_CRCERR_FLAG            (1 << SPI_SR_CRCERR)
#define SPI_MODF_FLAG              (1 << SPI_SR_MODF)
#define SPI_OVR_FLAG               (1 << SPI_SR_OVR)
#define SPI_BSY_FLAG               (1 << SPI_SR_BSY)
#define SPI_FRE_FLAG               (1 << SPI_SR_FRE)
#define SPI_FRLVL_FLAG             (3 << SPI_SR_FRLVL)
#define SPI_FTLVL_FLAG             (3 << SPI_SR_FTLVL)

/******************************************************************************************
 *								APIs supported by this driver
 *		 For more information about the APIs check the function definitions
 ******************************************************************************************/
/*
 * Peripheral Clock setup
 */
void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnorDi);

/*
 * Init and De-init
 */
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_RegDef_t *pSPIx);


/*
 * Data Send and Receive
 */
void SPI_Send_8Bits_Data(SPI_RegDef_t *pSPIx,uint8_t *pTxBuffer, uint32_t Len);
//void SPI_Send_16Bits_Data(SPI_RegDef_t *pSPIx,uint8_t *pTxBuffer, uint32_t Len);
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len);



/*
 * IRQ Configuration and ISR handling
 */
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void SPI_IRQHandling(SPI_Handle_t *pHandle);

/*
 * Other Peripheral Control APIs
 */
uint8_t SPI_GetFlag_status(SPI_RegDef_t *pSPIx,  uint32_t FlagName);
void SPI_Peripheral_Control(SPI_RegDef_t *pSPIx,uint8_t EnorDi);
void SPI_SSIConfig(SPI_RegDef_t *pSPIx,uint8_t EnOrDi);
void SPI_SSOEConfig(SPI_RegDef_t *pSPIx,uint8_t EnOrDi);

#endif /* INC_STM32F746XX_SPI_DRIVER_H_ */
